NextFOAM-2407/tutorials/basic/potentialFoam/pitzDaily/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication $(getApplication) -writePhi -writephi -writep

runApplication postProcess -func streamFunction

#------------------------------------------------------------------------------
